from django.shortcuts import render

# Create your views here.
def home(request):
    h = "%s%s%s" % ("○○部○○署", 104, "年度○○裝備檢查保養常識測驗")
    text = {
        "t1": "【車輛裝備】保養常識練習題庫（選擇50題）",
        "t2": "【車輛裝備】保養常識練習題庫（是非50題）",
        "t3": "【武器裝備】保養常識練習題庫（選擇50題）",
        "t4": "【武器裝備】保養常識練習題庫（是非50題）",
        "t5": "【通訊裝備】保養常識練習題庫（選擇50題）",
        "t6": "【通訊裝備】保養常識練習題庫（是非50題）",
        "t7": "【防彈裝備】保養常識練習題庫（選擇20題）",
        "t8": "【防彈裝備】保養常識練習題庫（是非20題）",
        "t9": "模擬測驗(隨機20題)",
    }
    text2 = ["【車輛裝備】保養常識練習題庫（選擇50題）", "【車輛裝備】保養常識練習題庫（是非50題）",
             "【武器裝備】保養常識練習題庫（選擇50題）", "【武器裝備】保養常識練習題庫（是非50題）",
             "【通訊裝備】保養常識練習題庫（選擇50題）", "【通訊裝備】保養常識練習題庫（是非50題）",
             "【防彈裝備】保養常識練習題庫（選擇20題）", "【防彈裝備】保養常識練習題庫（是非20題）",
             "模擬測驗(隨機20題)",]
    return render(request, 'home.html', {
        "header": h,
        "text2": text2,
        })
